In [1]:
import pandas as pd
from pathlib import Path
import numpy as np

# File to Load
homicide_csv = Path("data/homicide_data.csv")

# Read homicide data file and store into Pandas DataFrame
homicide_data = pd.read_csv(homicide_csv, encoding='latin1')

In [2]:
homicide_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52179 entries, 0 to 52178
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   uid            52179 non-null  object
 1   reported_date  52179 non-null  int64
 2   victim_last    52178 non-null  object
 3   victim_first   52179 non-null  object
 4   victim_race    52179 non-null  object
 5   victim_age     52179 non-null  object
 6   victim_sex     52179 non-null  object
 7   city           52179 non-null  object
 8   state          52179 non-null  object
 9   lat            52119 non-null  float64
 10  lon            52119 non-null  float64
 11  disposition    52179 non-null  object
dtypes: float64(2), int64(1), object(9)
memory usage: 4.8+ MB

In [3]:
homicide_data['state'].unique()

array(['NM', 'GA', 'MD', 'LA', 'AL', 'MA', 'NY', 'NC', 'IL', 'OH', 'TX',
       'CO', 'MI', 'CA', 'IN', 'FL', 'MO', 'NV', 'KY', 'TN', 'wI', 'MN',
       'OK', 'NE', 'PA', 'AZ', 'VA', 'DC'], dtype=object)

In [4]:
#Wisconsin is WI no wI
homicide_data['state'] = homicide_data['state'].replace('wI', 'WI')

In [5]:
#Some states/cities did not disclose victim names
homicide_data =  homicide_data.drop(columns = ["victim_last", "victim_first"])

In [6]:
# Replace "unknown" values with NaN
homicide_data.replace('Unknown', pd.NA, inplace=True)

# Drop rows with NaN values in any column
homicide_data.dropna(axis=0, how='any', inplace=True)

# Now, 'homicide_data' contains rows where any column is not "Unknown"

In [7]:
homicide_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 47478 entries, 0 to 52178
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   uid            47478 non-null  object
 1   reported_date  47478 non-null  int64
 2   victim_race    47478 non-null  object
 3   victim_age     47478 non-null  object
 4   victim_sex     47478 non-null  object
 5   city           47478 non-null  object
 6   state          47478 non-null  object
 7   lat            47478 non-null  float64
 8   lon            47478 non-null  float64
 9   disposition    47478 non-null  object
dtypes: float64(2), int64(1), object(7)
memory usage: 4.0+ MB

In [8]:
homicide_data.head()

,uid,reported_date,victim_race,victim_age,victim_sex,city,state,lat,lon,disposition
0,Alb-000001,20100504,Hispanic,78,Male,Albuquerque,NM,35.095788,-106.538555,Closed without arrest
1,Alb-000002,20100216,Hispanic,17,Male,Albuquerque,NM,35.056810,-106.715321,Closed by arrest
2,Alb-000003,20100601,White,15,Female,Albuquerque,NM,35.086092,-106.695568,Closed without arrest
3,Alb-000004,20100101,Hispanic,32,Male,Albuquerque,NM,35.078493,-106.556094,Closed by arrest
4,Alb-000005,20100102,White,72,Female,Albuquerque,NM,35.130357,-106.580986,Closed without arrest

In [9]:
homicide_data.disposition = homicide_data.disposition.replace("Closed without arrest", "No Arrest")
homicide_data.disposition = homicide_data.disposition.replace("Open/No arrest", "No Arrest")
homicide_data.disposition = homicide_data.disposition.replace("Closed by arrest", "Arrest Made")

In [10]:
homicide_data.disposition.value_counts()

No Arrest      24258
Arrest Made    23220
Name: disposition, dtype: int64

In [11]:
homicide_data.columns

Index(['uid', 'reported_date', 'victim_race', 'victim_age', 'victim_sex',
       'city', 'state', 'lat', 'lon', 'disposition'],
      dtype='object')

In [12]:
homicide_data['reported_date'] = pd.to_datetime(homicide_data['reported_date'], format='%Y%m%d')

In [53]:
homicide_data['reported_year'] = homicide_data['reported_date'].dt.year
homicide_data['reported_month'] = homicide_data['reported_date'].dt.month

In [54]:
homicide_data['reported_month'].value_counts()

7     4624
8     4360
6     4273
5     4210
9     4131
10    4060
12    3890
11    3886
4     3779
1     3682
3     3622
2     2961
Name: reported_month, dtype: int64

In [60]:
homicide_data.head()

,uid,reported_date,victim_race,victim_age,victim_sex,city,state,lat,lon,disposition,reported_year,age_range,LOCATION,reported_month
0,Alb-000001,2010-05-04,Hispanic,78,Male,Albuquerque,NM,35.095788,-106.538555,No Arrest,2010,65+,"Albuquerque, NM",5
1,Alb-000002,2010-02-16,Hispanic,17,Male,Albuquerque,NM,35.056810,-106.715321,Arrest Made,2010,0-17,"Albuquerque, NM",2
2,Alb-000003,2010-06-01,White,15,Female,Albuquerque,NM,35.086092,-106.695568,No Arrest,2010,0-17,"Albuquerque, NM",6
3,Alb-000004,2010-01-01,Hispanic,32,Male,Albuquerque,NM,35.078493,-106.556094,Arrest Made,2010,30-44,"Albuquerque, NM",1
4,Alb-000005,2010-01-02,White,72,Female,Albuquerque,NM,35.130357,-106.580986,No Arrest,2010,65+,"Albuquerque, NM",1

In [55]:
# Convert 'victim_age' to numeric
homicide_data['victim_age'] = pd.to_numeric(homicide_data['victim_age'])

# Define the age bins and labels
age_bins = [0, 18, 30, 45, 64, float('inf')]
age_labels = ['0-17', '18-29', '30-44', '45-64', '65+']

# Bin the 'victim_age' column and create a new column 'age_range'
homicide_data['age_range'] = pd.cut(homicide_data['victim_age'], bins=age_bins, labels=age_labels, right=False)

In [56]:
homicide_data.age_range.value_counts()

18-29    21428
30-44    13461
45-64     7144
0-17      3916
65+       1529
Name: age_range, dtype: int64

In [58]:
homicide_data.reported_date.unique()

array(['2010-05-04T00:00:00.000000000', '2010-02-16T00:00:00.000000000',
       '2010-06-01T00:00:00.000000000', ...,
       '2009-06-12T00:00:00.000000000', '2014-11-27T00:00:00.000000000',
       '2009-11-22T00:00:00.000000000'], dtype='datetime64[ns]')

In [18]:
homicide_data.head()

,uid,reported_date,victim_race,victim_age,victim_sex,city,state,lat,lon,disposition,reported_year,age_range
0,Alb-000001,2010-05-04,Hispanic,78,Male,Albuquerque,NM,35.095788,-106.538555,No Arrest,2010,65+
1,Alb-000002,2010-02-16,Hispanic,17,Male,Albuquerque,NM,35.056810,-106.715321,Arrest Made,2010,0-17
2,Alb-000003,2010-06-01,White,15,Female,Albuquerque,NM,35.086092,-106.695568,No Arrest,2010,0-17
3,Alb-000004,2010-01-01,Hispanic,32,Male,Albuquerque,NM,35.078493,-106.556094,Arrest Made,2010,30-44
4,Alb-000005,2010-01-02,White,72,Female,Albuquerque,NM,35.130357,-106.580986,No Arrest,2010,65+

In [19]:
# Create a new column 'LOCATION' by concatenating 'city' and 'state' with a comma separator
homicide_data['LOCATION'] = homicide_data['city'] + ', ' + homicide_data['state']

In [20]:
homicide_data['LOCATION'].unique()

array(['Albuquerque, NM', 'Atlanta, GA', 'Baltimore, MD',
       'Baton Rouge, LA', 'Birmingham, AL', 'Boston, MA', 'Buffalo, NY',
       'Charlotte, NC', 'Chicago, IL', 'Cincinnati, OH', 'Columbus, OH',
       'Denver, CO', 'Detroit, MI', 'Durham, NC', 'Fort Worth, TX',
       'Fresno, CA', 'Houston, TX', 'Indianapolis, IN',
       'Jacksonville, FL', 'Las Vegas, NV', 'Long Beach, CA',
       'Los Angeles, CA', 'Louisville, KY', 'Memphis, TN', 'Miami, FL',
       'Milwaukee, WI', 'Minneapolis, MN', 'Nashville, TN',
       'New Orleans, LA', 'New York, NY', 'Oakland, CA',
       'Oklahoma City, OK', 'Omaha, NE', 'Philadelphia, PA',
       'Pittsburgh, PA', 'Richmond, VA', 'San Antonio, TX',
       'Sacramento, CA', 'Savannah, GA', 'San Bernardino, CA',
       'San Diego, CA', 'San Francisco, CA', 'St. Louis, MO',
       'Stockton, CA', 'Tampa, FL', 'Tulsa, OK', 'Tulsa, AL',
       'Washington, DC'], dtype=object)

In [21]:
#There is no Tulsa, AL. The lon and lat indicate Oklahoma.
# Replace 'AL' with 'OK' for 'LOCATION' containing 'city' Tulsa.
homicide_data['LOCATION'] = homicide_data['LOCATION'].str.replace(r'Tulsa.*, AL$', 'Tulsa, OK', regex=True)

In [22]:
locations_to_keep = homicide_data['LOCATION'].unique()

In [23]:
# Specify the path for the new CSV file where you want to save the filtered data
output_csv = Path("data/filtered_homicide_data.csv")

# Save the filtered DataFrame to the new CSV file
homicide_data.to_csv(output_csv, index=False)

In [69]:
homicide_data.head()

,uid,reported_date,victim_race,victim_age,victim_sex,city,state,lat,lon,disposition,reported_year,age_range,LOCATION,reported_month
0,Alb-000001,2010-05-04,Hispanic,78,Male,Albuquerque,NM,35.095788,-106.538555,No Arrest,2010,65+,"Albuquerque, NM",5
1,Alb-000002,2010-02-16,Hispanic,17,Male,Albuquerque,NM,35.056810,-106.715321,Arrest Made,2010,0-17,"Albuquerque, NM",2
2,Alb-000003,2010-06-01,White,15,Female,Albuquerque,NM,35.086092,-106.695568,No Arrest,2010,0-17,"Albuquerque, NM",6
3,Alb-000004,2010-01-01,Hispanic,32,Male,Albuquerque,NM,35.078493,-106.556094,Arrest Made,2010,30-44,"Albuquerque, NM",1
4,Alb-000005,2010-01-02,White,72,Female,Albuquerque,NM,35.130357,-106.580986,No Arrest,2010,65+,"Albuquerque, NM",1

***Population Data***

In [24]:
# Define the file paths using Path
Est_2010_csv = Path("data/SubEst2010.csv")
Est_2020_csv = Path("data/SubEst2020.csv")

# Load SubEst2010.csv into a DataFrame with the specified encoding
df_2010 = pd.read_csv(Est_2010_csv, encoding='latin1')

# Load SubEst2020.csv into a DataFrame with the specified encoding
df_2020 = pd.read_csv(Est_2020_csv, encoding='latin1')

In [25]:
state_abbreviations = {
    'Alabama': 'AL',
    'Alaska': 'AK',
    'Arizona': 'AZ',
    'Arkansas': 'AR',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'Delaware': 'DE',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Hawaii': 'HI',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Iowa': 'IA',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Maine': 'ME',
    'Maryland': 'MD',
    'Massachusetts': 'MA',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Mississippi': 'MS',
    'Missouri': 'MO',
    'Montana': 'MT',
    'Nebraska': 'NE',
    'Nevada': 'NV',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'New York': 'NY',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Pennsylvania': 'PA',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Vermont': 'VT',
    'Virginia': 'VA',
    'Washington': 'WA',
    'West Virginia': 'WV',
    'Wisconsin': 'WI',
    'Wyoming': 'WY',
    'District of Columbia': 'DC'
}

In [26]:
df_2010.head()

,SUMLEV,STATE,COUNTY,PLACE,COUSUB,NAME,STNAME,ESTIMATESBASE2000,POPESTIMATE2000,POPESTIMATE2001,POPESTIMATE2002,POPESTIMATE2003,POPESTIMATE2004,POPESTIMATE2005,POPESTIMATE2006,POPESTIMATE2007,POPESTIMATE2008,POPESTIMATE2009,CENSUS2010POP,POPESTIMATE2010
0,40,1,0,0,0,Alabama,Alabama,4447207,4452173,4467634,4480089,4503491,4530729,4569805,4628981,4672840,4718206,4757938,4779736,4785298
1,162,1,0,124,0,Abbeville city,Alabama,2989,2985,2941,2909,2882,2857,2820,2807,2784,2742,2714,2688,2689
2,162,1,0,460,0,Adamsville city,Alabama,5033,5021,4960,4894,4841,4784,4728,4687,4633,4594,4558,4522,4523
3,162,1,0,484,0,Addison town,Alabama,698,701,701,708,714,722,729,741,750,752,759,758,755
4,162,1,0,676,0,Akron town,Alabama,488,485,473,454,442,426,416,404,395,384,369,356,355

In [27]:
df_2010.columns

Index(['SUMLEV', 'STATE', 'COUNTY', 'PLACE', 'COUSUB', 'NAME', 'STNAME',
       'ESTIMATESBASE2000', 'POPESTIMATE2000', 'POPESTIMATE2001',
       'POPESTIMATE2002', 'POPESTIMATE2003', 'POPESTIMATE2004',
       'POPESTIMATE2005', 'POPESTIMATE2006', 'POPESTIMATE2007',
       'POPESTIMATE2008', 'POPESTIMATE2009', 'CENSUS2010POP',
       'POPESTIMATE2010'],
      dtype='object')

In [28]:
df_2010['STNAME'] = df_2010['STNAME'].replace(state_abbreviations)

In [29]:
df_2010.head()

,SUMLEV,STATE,COUNTY,PLACE,COUSUB,NAME,STNAME,ESTIMATESBASE2000,POPESTIMATE2000,POPESTIMATE2001,POPESTIMATE2002,POPESTIMATE2003,POPESTIMATE2004,POPESTIMATE2005,POPESTIMATE2006,POPESTIMATE2007,POPESTIMATE2008,POPESTIMATE2009,CENSUS2010POP,POPESTIMATE2010
0,40,1,0,0,0,Alabama,AL,4447207,4452173,4467634,4480089,4503491,4530729,4569805,4628981,4672840,4718206,4757938,4779736,4785298
1,162,1,0,124,0,Abbeville city,AL,2989,2985,2941,2909,2882,2857,2820,2807,2784,2742,2714,2688,2689
2,162,1,0,460,0,Adamsville city,AL,5033,5021,4960,4894,4841,4784,4728,4687,4633,4594,4558,4522,4523
3,162,1,0,484,0,Addison town,AL,698,701,701,708,714,722,729,741,750,752,759,758,755
4,162,1,0,676,0,Akron town,AL,488,485,473,454,442,426,416,404,395,384,369,356,355

In [30]:
# Remove ' city' and ' town' from the 'NAME' column
df_2010['NAME'] = df_2010['NAME'].str.replace(r' city.*$', '', regex=True)
df_2010['NAME'] = df_2010['NAME'].str.replace(r' town.*$', '', regex=True)
df_2010['NAME'] = df_2010['NAME'].str.replace(r' village.*$', '', regex=True)
df_2010['NAME'] = df_2010['NAME'].str.replace(r'/.*$', '', regex=True)
df_2010['NAME'] = df_2010['NAME'].str.replace(r'-.*$', '', regex=True)

In [31]:
# Create a new column 'LOCATION' by concatenating 'NAME' and 'STNAME' with a comma separator
df_2010['LOCATION'] = df_2010['NAME'] + ', ' + df_2010['STNAME']

In [32]:
# Select and retain only the desired columns
columns_to_keep_2010 = ['NAME', 'STNAME', 'LOCATION', 'POPESTIMATE2007', 'POPESTIMATE2008', 'POPESTIMATE2009']
df_2010 = df_2010[columns_to_keep_2010]

In [33]:
df_2010.head()

,NAME,STNAME,LOCATION,POPESTIMATE2007,POPESTIMATE2008,POPESTIMATE2009
0,Alabama,AL,"Alabama, AL",4672840,4718206,4757938
1,Abbeville,AL,"Abbeville, AL",2784,2742,2714
2,Adamsville,AL,"Adamsville, AL",4633,4594,4558
3,Addison,AL,"Addison, AL",750,752,759
4,Akron,AL,"Akron, AL",395,384,369

In [34]:
df_2020.head()

,SUMLEV,STATE,COUNTY,PLACE,COUSUB,CONCIT,PRIMGEO_FLAG,FUNCSTAT,NAME,STNAME,...,POPESTIMATE2012,POPESTIMATE2013,POPESTIMATE2014,POPESTIMATE2015,POPESTIMATE2016,POPESTIMATE2017,POPESTIMATE2018,POPESTIMATE2019,POPESTIMATE042020,POPESTIMATE2020
0,40,1,0,0,0,0,0,A,Alabama,Alabama,...,4816632,4831586,4843737,4854803,4866824,4877989,4891628,4907965,4920706,4921532
1,162,1,0,124,0,0,0,A,Abbeville city,Alabama,...,2645,2629,2610,2602,2587,2578,2565,2555,2555,2553
2,162,1,0,460,0,0,0,A,Adamsville city,Alabama,...,4453,4430,4399,4371,4335,4304,4285,4254,4224,4211
3,162,1,0,484,0,0,0,A,Addison town,Alabama,...,745,744,742,734,734,728,725,723,719,717
4,162,1,0,676,0,0,0,A,Akron town,Alabama,...,347,344,338,338,335,332,332,328,328,327

In [35]:
df_2020.columns

Index(['SUMLEV', 'STATE', 'COUNTY', 'PLACE', 'COUSUB', 'CONCIT',
       'PRIMGEO_FLAG', 'FUNCSTAT', 'NAME', 'STNAME', 'CENSUS2010POP',
       'ESTIMATESBASE2010', 'POPESTIMATE2010', 'POPESTIMATE2011',
       'POPESTIMATE2012', 'POPESTIMATE2013', 'POPESTIMATE2014',
       'POPESTIMATE2015', 'POPESTIMATE2016', 'POPESTIMATE2017',
       'POPESTIMATE2018', 'POPESTIMATE2019', 'POPESTIMATE042020',
       'POPESTIMATE2020'],
      dtype='object')

In [36]:
df_2020['STNAME'] = df_2020['STNAME'].replace(state_abbreviations)

In [37]:
# Remove ' city' and ' town' from the 'NAME' column
df_2020['NAME'] = df_2020['NAME'].str.replace(r' city.*$', '', regex=True)
df_2020['NAME'] = df_2020['NAME'].str.replace(r' town.*$', '', regex=True)
df_2020['NAME'] = df_2020['NAME'].str.replace(r' village.*$', '', regex=True)
df_2020['NAME'] = df_2020['NAME'].str.replace(r'/.*$', '', regex=True)
df_2020['NAME'] = df_2020['NAME'].str.replace(r'-.*$', '', regex=True)

In [38]:
# Create a new column 'LOCATION' by concatenating 'NAME' and 'STNAME' with a comma separator
df_2020['LOCATION'] = df_2020['NAME'] + ', ' + df_2020['STNAME']

In [39]:
# Select and retain only the desired columns
columns_to_keep_2020 = ['NAME', 'STNAME', 'LOCATION', 'CENSUS2010POP', 'POPESTIMATE2011',
       'POPESTIMATE2012', 'POPESTIMATE2013', 'POPESTIMATE2014',
       'POPESTIMATE2015', 'POPESTIMATE2016', 'POPESTIMATE2017']
df_2020 = df_2020[columns_to_keep_2020]

In [40]:
df_2020.head()

,NAME,STNAME,LOCATION,CENSUS2010POP,POPESTIMATE2011,POPESTIMATE2012,POPESTIMATE2013,POPESTIMATE2014,POPESTIMATE2015,POPESTIMATE2016,POPESTIMATE2017
0,Alabama,AL,"Alabama, AL",4779736,4799642,4816632,4831586,4843737,4854803,4866824,4877989
1,Abbeville,AL,"Abbeville, AL",2688,2694,2645,2629,2610,2602,2587,2578
2,Adamsville,AL,"Adamsville, AL",4522,4474,4453,4430,4399,4371,4335,4304
3,Addison,AL,"Addison, AL",758,750,745,744,742,734,734,728
4,Akron,AL,"Akron, AL",356,347,347,344,338,338,335,332

In [41]:
merged_df = df_2010.merge(df_2020, on=['NAME', 'STNAME', 'LOCATION'], how='inner')

In [42]:
merged_df.columns

Index(['NAME', 'STNAME', 'LOCATION', 'POPESTIMATE2007', 'POPESTIMATE2008',
       'POPESTIMATE2009', 'CENSUS2010POP', 'POPESTIMATE2011',
       'POPESTIMATE2012', 'POPESTIMATE2013', 'POPESTIMATE2014',
       'POPESTIMATE2015', 'POPESTIMATE2016', 'POPESTIMATE2017'],
      dtype='object')

In [43]:
# Create a mapping dictionary for column renaming
column_name_mapping = {
    'POPESTIMATE2007': '2007',
    'POPESTIMATE2008': '2008',
    'POPESTIMATE2009': '2009',
    'CENSUS2010POP': '2010',
    'POPESTIMATE2011': '2011',
    'POPESTIMATE2012': '2012',
    'POPESTIMATE2013': '2013',
    'POPESTIMATE2014': '2014',
    'POPESTIMATE2015': '2015',
    'POPESTIMATE2016': '2016',
    'POPESTIMATE2017': '2017'
}

In [44]:
# Rename the columns based on the mapping dictionary
merged_df = merged_df.rename(columns=column_name_mapping)

In [45]:
merged_df.head()

,NAME,STNAME,LOCATION,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,Alabama,AL,"Alabama, AL",4672840,4718206,4757938,4779736,4799642,4816632,4831586,4843737,4854803,4866824,4877989
1,Abbeville,AL,"Abbeville, AL",2784,2742,2714,2688,2694,2645,2629,2610,2602,2587,2578
2,Abbeville,AL,"Abbeville, AL",2784,2742,2714,2688,2694,2645,2629,2610,2602,2587,2578
3,Abbeville,AL,"Abbeville, AL",2784,2742,2714,2688,2694,2645,2629,2610,2602,2587,2578
4,Abbeville,AL,"Abbeville, AL",2784,2742,2714,2688,2694,2645,2629,2610,2602,2587,2578

In [46]:
# Remove duplicate rows based on 'LOCATION' column
merged_df = merged_df.drop_duplicates(subset=['LOCATION'])

In [47]:
merged_df.head()

,NAME,STNAME,LOCATION,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,Alabama,AL,"Alabama, AL",4672840,4718206,4757938,4779736,4799642,4816632,4831586,4843737,4854803,4866824,4877989
1,Abbeville,AL,"Abbeville, AL",2784,2742,2714,2688,2694,2645,2629,2610,2602,2587,2578
5,Adamsville,AL,"Adamsville, AL",4633,4594,4558,4522,4474,4453,4430,4399,4371,4335,4304
9,Addison,AL,"Addison, AL",750,752,759,758,750,745,744,742,734,734,728
13,Akron,AL,"Akron, AL",395,384,369,356,347,347,344,338,338,335,332

In [48]:
# Find the row where 'LOCATION' is equal to 'Your_Location'
matching_rows = merged_df[merged_df['LOCATION'].str.contains('Tulsa', case=False, na=False)]

# Display the specific location
print(matching_rows)

                           NAME STNAME                     LOCATION    2007  \
204972                    Tulsa     OK                    Tulsa, OK  385779
205371             Tulsa County     OK             Tulsa County, OK  582094
205372  Balance of Tulsa County     OK  Balance of Tulsa County, OK   33388

          2008    2009    2010    2011    2012    2013    2014    2015  \
204972  387130  390339  391906  392937  394616  398419  399945  403576
205371  588510  597748  603403  609323  615376  623978  631241  640851
205372   33845   34450   34828   34197   34378   34809   35162   35600

          2016    2017
204972  404086  402177
205371  646328  646874
205372   35878   35954

In [49]:
filtered_pop_df = merged_df[merged_df['LOCATION'].isin(locations_to_keep)]

In [95]:
filtered_pop_df.head()

,NAME,STNAME,LOCATION,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
180,Birmingham,AL,"Birmingham, AL",218880,216505,214394,212237,211554,210775,211270,211179,211811,211512,211125
6143,Fresno,CA,"Fresno, CA",477659,484443,490262,494665,501623,505554,508993,514052,517408,520305,523938
6475,Long Beach,CA,"Long Beach, CA",460328,460643,461782,462257,464274,466526,468017,468785,469408,468484,466265
6495,Los Angeles,CA,"Los Angeles, CA",3751872,3763566,3781938,3792621,3818812,3847857,3877721,3904102,3933644,3957520,3975067
6699,Oakland,CA,"Oakland, CA",383500,386589,389613,390724,395416,400720,406609,412677,418539,421454,421938

In [62]:
filtered_pop_df.columns

Index(['NAME', 'STNAME', 'LOCATION', '2007', '2008', '2009', '2010', '2011',
       '2012', '2013', '2014', '2015', '2016', '2017'],
      dtype='object')

In [63]:
id_vars = ['NAME', 'STNAME', 'LOCATION']
value_vars = ['2007', '2008', '2009', '2010', '2011',
       '2012', '2013', '2014', '2015', '2016', '2017']

In [86]:
df_booth = pd.melt(filtered_pop_df,id_vars=id_vars,value_vars=value_vars,var_name="YEAR", value_name="POPULATION")
df_booth['YEAR'] = df_booth.YEAR.astype(int)
df_booth['POPULATION'] = df_booth.POPULATION.astype(int)

In [87]:
df_booth.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 517 entries, 0 to 516
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   NAME        517 non-null    object
 1   STNAME      517 non-null    object
 2   LOCATION    517 non-null    object
 3   YEAR        517 non-null    int32
 4   POPULATION  517 non-null    int32
dtypes: int32(2), object(3)
memory usage: 16.3+ KB

In [88]:
df_final = pd.merge(homicide_data, df_booth, left_on = ['LOCATION','reported_year'],
                    right_on = ['LOCATION', 'YEAR'], how = 'left')

In [89]:
df_final.head()

,uid,reported_date,victim_race,victim_age,victim_sex,city,state,lat,lon,disposition,reported_year,age_range,LOCATION,reported_month,NAME,STNAME,YEAR,POPULATION
0,Alb-000001,2010-05-04,Hispanic,78,Male,Albuquerque,NM,35.095788,-106.538555,No Arrest,2010,65+,"Albuquerque, NM",5,Albuquerque,NM,2010,545852
1,Alb-000002,2010-02-16,Hispanic,17,Male,Albuquerque,NM,35.056810,-106.715321,Arrest Made,2010,0-17,"Albuquerque, NM",2,Albuquerque,NM,2010,545852
2,Alb-000003,2010-06-01,White,15,Female,Albuquerque,NM,35.086092,-106.695568,No Arrest,2010,0-17,"Albuquerque, NM",6,Albuquerque,NM,2010,545852
3,Alb-000004,2010-01-01,Hispanic,32,Male,Albuquerque,NM,35.078493,-106.556094,Arrest Made,2010,30-44,"Albuquerque, NM",1,Albuquerque,NM,2010,545852
4,Alb-000005,2010-01-02,White,72,Female,Albuquerque,NM,35.130357,-106.580986,No Arrest,2010,65+,"Albuquerque, NM",1,Albuquerque,NM,2010,545852

In [94]:
lol = df_final.groupby(["LOCATION","reported_year"]).agg({"uid":"size","POPULATION": 'max'}).reset_index()
lol["homicides_per_100000"] = lol["uid"]/lol["POPULATION"]*100000

lol.sort_values(by = "homicides_per_100000", ascending=False).head(20)

            LOCATION  reported_year  uid  POPULATION  homicides_per_100000
430    St. Louis, MO           2017  200      308424             64.845797
428    St. Louis, MO           2015  186      316268             58.810882
429    St. Louis, MO           2016  184      312926             58.799844
290  New Orleans, LA           2011  205      360822             56.814718
29     Baltimore, MD           2017  340      610853             55.659872
124      Detroit, MI           2012  385      700289             54.977302
27     Baltimore, MD           2015  342      622831             54.910562
291  New Orleans, LA           2012  201      369947             54.332107
28     Baltimore, MD           2016  320      616542             51.902385
421    St. Louis, MO           2008  165      317955             51.894136
289  New Orleans, LA           2010  175      343829             50.897394
427    St. Louis, MO           2014  159      317599             50.063130
123      Detroit, MI           2011  345      705202             48.922153
125      Detroit, MI           2013  331      691986             47.833338
47    Birmingham, AL           2017   97      211125             45.944346
422    St. Louis, MO           2009  145      318842             45.477070
19     Baltimore, MD           2007  280      620306             45.139012
295  New Orleans, LA           2016  173      392265             44.102839
423    St. Louis, MO           2010  140      319294             43.846737
122      Detroit, MI           2010  310      713777             43.430932

In [51]:
#Trouble Shooting Missing Cities
# Define List 1 and List 2
list1 = locations_to_keep

list2 = filtered_pop_df['LOCATION'].unique()

# Convert both lists to sets for efficient set operations
set1 = set(list1)
set2 = set(list2)

# Find cities in List 1 that are not in List 2
cities_not_in_list2 = set1 - set2

# Convert the result back to a list if needed
cities_not_in_list2_list = list(cities_not_in_list2)

# Print the cities not in List 2
print("Cities in List 1 but not in List 2:")
for city in cities_not_in_list2_list:
    print(city)

Cities in List 1 but not in List 2:

In [52]:
# Specify the path for the new CSV file where you want to save the filtered data
output_csv = Path("data/filtered_pop_data.csv")

# Save the filtered DataFrame to the new CSV file
filtered_pop_df.to_csv(output_csv, index=False, header=True)